In [121]:

# 리스트
a = [1, 2, 3, 4, 5]
a[2]   # 인덱싱
a[1:5]  # 슬라이싱

[2, 3, 4, 5]

In [122]:
import pandas as pd

df = pd.read_csv("./temp.csv")
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110

In [123]:
# 인덱싱

df.loc[0]
df.loc[1]

메뉴     카페라떼
가격     2000
칼로리     110
Name: 1, dtype: object

In [124]:
df.loc[1,"가격"]

np.int64(2000)

In [125]:
# 슬라이싱
df.loc[0:7, "가격"]
df.loc[:, "가격"]

0    1500
1    2000
2    3000
3    2000
4    1500
5    3000
6    4000
Name: 가격, dtype: int64

In [126]:
df.loc[:, "가격":"칼로리"]

     가격  칼로리
0  1500   10
1  2000  110
2  3000  250
3  2000  110
4  1500   20
5  3000  210
6  4000    0

In [127]:
# 인덱싱 / 슬라이싱 (iloc)
df

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
5    밀크티  3000  210
6     녹차  4000    0

In [128]:
df.iloc[0]

메뉴     아메리카노
가격      1500
칼로리       10
Name: 0, dtype: object

In [129]:
df.iloc[:,2]

0     10
1    110
2    250
3    110
4     20
5    210
6      0
Name: 칼로리, dtype: int64

In [130]:
df.iloc[2, 1:3]

가격     3000
칼로리     250
Name: 2, dtype: object

In [131]:
# 데이터 추가/변경

import numpy as np

df["원산지"] = np.nan

df

      메뉴    가격  칼로리  원산지
0  아메리카노  1500   10  NaN
1   카페라떼  2000  110  NaN
2   카페모카  3000  250  NaN
3   카푸치노  2000  110  NaN
4  에스프레소  1500   20  NaN
5    밀크티  3000  210  NaN
6     녹차  4000    0  NaN

In [132]:
# loc를 통해서 값 변경

df.loc[0, "원산지"] = "콜롬비아"
df.loc[2:5, "원산지"] = "과테말라"

df

C:\Users\krcea\AppData\Local\Temp\ipykernel_5292\771053502.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '콜롬비아' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[0, "원산지"] = "콜롬비아"

      메뉴    가격  칼로리   원산지
0  아메리카노  1500   10  콜롬비아
1   카페라떼  2000  110   NaN
2   카페모카  3000  250  과테말라
3   카푸치노  2000  110  과테말라
4  에스프레소  1500   20  과테말라
5    밀크티  3000  210  과테말라
6     녹차  4000    0   NaN

In [133]:
df.loc ["시즌"] = ["크리스마스 라떼", 6000, 500, "한국"]
df

          메뉴    가격  칼로리   원산지
0      아메리카노  1500   10  콜롬비아
1       카페라떼  2000  110   NaN
2       카페모카  3000  250  과테말라
3       카푸치노  2000  110  과테말라
4      에스프레소  1500   20  과테말라
5        밀크티  3000  210  과테말라
6         녹차  4000    0   NaN
시즌  크리스마스 라떼  6000  500    한국

In [134]:
# loc와 딕셔너리를 활용한 값 추가

df.loc[7] = {"메뉴": "구미라떼", "가격":2000, "칼로리":20}
df

          메뉴    가격  칼로리   원산지
0      아메리카노  1500   10  콜롬비아
1       카페라떼  2000  110   NaN
2       카페모카  3000  250  과테말라
3       카푸치노  2000  110  과테말라
4      에스프레소  1500   20  과테말라
5        밀크티  3000  210  과테말라
6         녹차  4000    0   NaN
시즌  크리스마스 라떼  6000  500    한국
7       구미라떼  2000   20   NaN

In [135]:
df.drop("시즌", axis=0, inplace=True)

In [136]:
df

      메뉴    가격  칼로리   원산지
0  아메리카노  1500   10  콜롬비아
1   카페라떼  2000  110   NaN
2   카페모카  3000  250  과테말라
3   카푸치노  2000  110  과테말라
4  에스프레소  1500   20  과테말라
5    밀크티  3000  210  과테말라
6     녹차  4000    0   NaN
7   구미라떼  2000   20   NaN

In [137]:
df.to_csv("cafe2.csv", index=False)

In [138]:
df.sort_index(ascending=False)

      메뉴    가격  칼로리   원산지
7   구미라떼  2000   20   NaN
6     녹차  4000    0   NaN
5    밀크티  3000  210  과테말라
4  에스프레소  1500   20  과테말라
3   카푸치노  2000  110  과테말라
2   카페모카  3000  250  과테말라
1   카페라떼  2000  110   NaN
0  아메리카노  1500   10  콜롬비아

In [139]:
df.sort_values(by="가격", ascending=False)

      메뉴    가격  칼로리   원산지
6     녹차  4000    0   NaN
2   카페모카  3000  250  과테말라
5    밀크티  3000  210  과테말라
1   카페라떼  2000  110   NaN
7   구미라떼  2000   20   NaN
3   카푸치노  2000  110  과테말라
0  아메리카노  1500   10  콜롬비아
4  에스프레소  1500   20  과테말라

In [140]:
df.sort_values("가격",ascending=True)
df

      메뉴    가격  칼로리   원산지
0  아메리카노  1500   10  콜롬비아
1   카페라떼  2000  110   NaN
2   카페모카  3000  250  과테말라
3   카푸치노  2000  110  과테말라
4  에스프레소  1500   20  과테말라
5    밀크티  3000  210  과테말라
6     녹차  4000    0   NaN
7   구미라떼  2000   20   NaN

In [141]:
df.sort_values("메뉴", ascending=False, inplace=True)
df

      메뉴    가격  칼로리   원산지
3   카푸치노  2000  110  과테말라
2   카페모카  3000  250  과테말라
1   카페라떼  2000  110   NaN
4  에스프레소  1500   20  과테말라
0  아메리카노  1500   10  콜롬비아
5    밀크티  3000  210  과테말라
6     녹차  4000    0   NaN
7   구미라떼  2000   20   NaN

In [142]:
df.sort_values(["가격","메뉴"], ascending=[True, False], inplace=True)
df

      메뉴    가격  칼로리   원산지
4  에스프레소  1500   20  과테말라
0  아메리카노  1500   10  콜롬비아
3   카푸치노  2000  110  과테말라
1   카페라떼  2000  110   NaN
7   구미라떼  2000   20   NaN
2   카페모카  3000  250  과테말라
5    밀크티  3000  210  과테말라
6     녹차  4000    0   NaN

In [143]:
# 인덱스 초기화
df.reset_index(drop=True)

      메뉴    가격  칼로리   원산지
0  에스프레소  1500   20  과테말라
1  아메리카노  1500   10  콜롬비아
2   카푸치노  2000  110  과테말라
3   카페라떼  2000  110   NaN
4   구미라떼  2000   20   NaN
5   카페모카  3000  250  과테말라
6    밀크티  3000  210  과테말라
7     녹차  4000    0   NaN

In [144]:
## 필터링

df=pd.read_csv("cafe2.csv")
df

      메뉴    가격  칼로리   원산지
0  아메리카노  1500   10  콜롬비아
1   카페라떼  2000  110   NaN
2   카페모카  3000  250  과테말라
3   카푸치노  2000  110  과테말라
4  에스프레소  1500   20  과테말라
5    밀크티  3000  210  과테말라
6     녹차  4000    0   NaN
7   구미라떼  2000   20   NaN

In [145]:
 cond = df["칼로리"] == 20
 df

      메뉴    가격  칼로리   원산지
0  아메리카노  1500   10  콜롬비아
1   카페라떼  2000  110   NaN
2   카페모카  3000  250  과테말라
3   카푸치노  2000  110  과테말라
4  에스프레소  1500   20  과테말라
5    밀크티  3000  210  과테말라
6     녹차  4000    0   NaN
7   구미라떼  2000   20   NaN

In [146]:
df[cond]

      메뉴    가격  칼로리   원산지
4  에스프레소  1500   20  과테말라
7   구미라떼  2000   20   NaN

In [147]:
df[df["원산지"] == "과테말라"]

      메뉴    가격  칼로리   원산지
2   카페모카  3000  250  과테말라
3   카푸치노  2000  110  과테말라
4  에스프레소  1500   20  과테말라
5    밀크티  3000  210  과테말라

In [148]:
# 문제. 칼로리가 200 이하이면서 가격이 5000원 이상인 메뉴를 필터링 하세요.

cond = (df["칼로리"] <= 200) & (df["가격"] >=2000)
df[cond]

     메뉴    가격  칼로리   원산지
1  카페라떼  2000  110   NaN
3  카푸치노  2000  110  과테말라
6    녹차  4000    0   NaN
7  구미라떼  2000   20   NaN

In [149]:
# Not 연산자
cond = df["칼로리"] <50
df[~cond]

     메뉴    가격  칼로리   원산지
1  카페라떼  2000  110   NaN
2  카페모카  3000  250  과테말라
3  카푸치노  2000  110  과테말라
5   밀크티  3000  210  과테말라

In [150]:
# 복수 조건 필터링
cond1 = df["가격"] > 5000
cond2 = df["칼로리"] >100

df[cond1 | cond2]

     메뉴    가격  칼로리   원산지
1  카페라떼  2000  110   NaN
2  카페모카  3000  250  과테말라
3  카푸치노  2000  110  과테말라
5   밀크티  3000  210  과테말라

In [151]:
# isin 필터링
cond = df["메뉴"].isin(["녹차"])

In [152]:
df[cond]

   메뉴    가격  칼로리  원산지
6  녹차  4000    0  NaN